#+TITLE: My Doom Emacs config
#+AUTHOR: Antonio Ruiz
*** Swap the semicolon and colon in certain modes & scenarios
#+BEGIN_SRC emacs-lisp :tangle yes
(defun swap-semicolon-colon ()
  (when (or (and (memq major-mode
                       '(agda2-mode
                         haskell-mode
                         ))
                 (eq (length (this-command-keys-vector))
                     1)))
    (cond ((eq (aref (this-command-keys-vector)
                     0)
               ?\;)
           (setq last-command-event
                 ?:))
          ((eq (aref (this-command-keys-vector)
                     0)
               ?:)
           (setq last-command-event
                 ?\;)))))

(add-hook 'pre-command-hook #'swap-semicolon-colon)
#+END_SRC

#+RESULTS:
| swap-semicolon-colon | sp--save-pre-command-state | gcmh-set-high-threshold | evil-escape-pre-command-hook | which-key--hide-popup | exwm-input--on-pre-command | magit-pre-command-hook | keyfreq-pre-command-hook | evil-repeat-pre-hook | eldoc-pre-command-refresh-echo-area |

*** Auto-correct more typos due Qukeys-related typos
#+BEGIN_SRC emacs-lisp :tangle yes :tangle yes
(defun correct-shifted-char ()
  (let (start end)
    (let ((s (save-excursion
               (buffer-substring-no-properties
                (progn (search-backward-regexp "[^a-zA-Z]" nil t)
                       (forward-char 1)
                       (setq start (point)))
                (progn (if (search-forward-regexp "[^a-zA-Z]" nil t)
                           (forward-char -1)
                         (end-of-line))
                       (setq end (point)))))))
      ;; (message "%s %s %s %s %s" s
      ;;          (and (> (length s) 3) (memq (aref s 1) consonants))
      ;;          start end
      ;;          (and (> (length s) 3)
      ;;               (concat (upcase (substring-no-properties s 1 2))
      ;;                       (substring-no-properties s 2 nil))))
      (when (and (> (length s) 3)
                 (eq (aref s 0) ?n)
                 (memq (aref s 1) consonants)
                 (not (string-prefix-p "ngin" s))
                 (not (string-prefix-p "nlab" s))
                 (or (memq (aref s 2) vowels)
                     (member (substring-no-properties s 1 3)
                             common-starting-consonant-bigrams)))
        (ignore-errors (delete-region start end)
                       (insert (concat (upcase (substring-no-properties s 1 2))
                                       (substring-no-properties s 2 nil))))))))

(add-hook 'post-self-insert-hook #'correct-shifted-char)
#+END_SRC

#+RESULTS:
| correct-shifted-char | sp--post-self-insert-hook-handler | _I_a_->_I_am_ | electric-indent-post-self-insert-function |
*** Enable abbrevs in minibuffer eval
:PROPERTIES:
:CREATED_TIME: [2020-01-20 Mon 16:15]
:END:
#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'minibuffer-setup-hook
          (lambda (&rest _)
            (when (eq this-command 'eval-expression)
              (abbrev-mode))))
#+END_SRC

#+RESULTS:
| (lambda (&rest _) (when (eq this-command 'eval-expression) (abbrev-mode))) | doom-init-smartparens-in-minibuffer-maybe-h | savehist-minibuffer-hook | exwm-input--on-minibuffer-setup | winner-save-unconditionally | +doom-disable-fringes-in-minibuffer-h | cursor-intangible-mode | rfn-eshadow-setup-minibuffer | minibuffer-history-isearch-setup | minibuffer-history-initialize | exwm-layout--on-minibuffer-setup |

*** COMMENT Display candidates in a childframe
:PROPERTIES:
:CREATED_TIME: [2020-01-23 Thu 20:44]
:END:
#+BEGIN_SRC emacs-lisp :tangle yes
(after! helm
  (require 'posframe)
  (defvar helm-display-function #'helm-posframe-display)

  (defvar helm-posframe-buffer nil)

  (defun helm-posframe-display (buffer &optional _resume)
    (posframe-show
     (setq helm-posframe-buffer buffer)
     :poshandler #'posframe-poshandler-frame-bottom-left-corner
     :left-fringe 10
     :width (window-width)
     :height 20
     :respect-header-line t))

  (defun helm-posframe-cleanup ()
    (posframe-hide helm-posframe-buffer))

  (add-hook 'helm-cleanup-hook #'helm-posframe-cleanup))
#+END_SRC

#+RESULTS:
| helm-posframe-cleanup | helm-ff-save-history | helm-find-files--reset-level-tree | helm-match-line-cleanup | helm-handle-winner-boring-buffers | helm-reset-yank-point |

**** Clean up whitespace in source code blocks
#+BEGIN_SRC emacs-lisp :tangle yes
(defvar +org-exit-src-code-hook nil
  "Hook run just before exiting a org source block buffer.")

(defun +org|run-exit-src-code-hooks (&rest _)
  "Runs all hooks in `+org-exit-src-code-hook`."
  (run-hooks '+org-exit-src-code-hook))

(advice-add #'org-edit-src-exit :before #'+org|run-exit-src-code-hooks)

(add-hook '+org-exit-src-code-hook #'ws-butler-trim-eob-lines)
#+END_SRC

#+RESULTS:
| (lambda nil (message hello)) | ws-butler-trim-eob-lines | whitespace-cleanup |
**** Notify when external commands finish
:PROPERTIES:
:CREATED_TIME: [2020-01-16 Thu 15:04]
:END:
#+BEGIN_SRC emacs-lisp :tangle yes
(after! eshell
  (require 'alert)

  (defun eshell-command-alert (process status)
    "Send `alert' with severity based on STATUS when PROCESS finished."
    (let* ((cmd (process-command process))
           (buffer (process-buffer process))
           (msg (format "%s: %s" (mapconcat 'identity cmd " ")  status)))
      (if (string-prefix-p "finished" status)
          (alert msg :buffer buffer :severity  'normal)
        (alert msg :buffer buffer :severity 'urgent))))

  (add-hook 'eshell-kill-hook #'eshell-command-alert)

  (alert-add-rule :status   '(buried)   ;only send alert when buffer not visible
                  :mode     'eshell-mode
                  :style 'notifications))
#+END_SRC

#+RESULTS:
| ((:status buried) (:mode . \`eshell-mode\')) | notifications | nil |

